[
    
    {
        "title": "Expectation Maximization Clustering",
        "description": "This was a two part project related to data science using bayesian logic for a classic classification problem. This method guesses that each class has a normal distribution of points and it uses test data to find the most likely clusters for a given point. One application of this method could be for classifying music into genres. Spotify for example gives several numerical properties to songs, and this would allow us to try to cluster them into specific genres and suggest music to a person if it is in the same genre. This project was coded in Python using the numpy library to compute math operations on large amounts of data efficiently.",
        "imageNames" :["clustering.gif"],
        "private": true,
        "form": ""
    },
    {
        "title": "Itemsets",
        "description": "This data science project analyzed relationships between itemsets. What does that mean? I used python and the pandas library to clean a long list of orders that had information on what user id bought the item, and with that, we can find patterns in the data. The specific pattern I found was based on confidence, which is not without its flaws a measurement, but other measurements can be easily substituted. The second image shows example output of my code from a very simple test example, showing that certain patterns of items bought will lead to another item being bought with a certain level of confidence.",
        "imageNames" :["itemsets.png", "assocRules.png"],
        "private": true,
        "form": ""
    },
    {
        "title": "Code Sharing",
        "description": "You are looking at this project right now! I made this site to share the work I've done in my computer science studies in a creative way. This project was made with React and implements tools like npm, Webpack, bootstrap, and many others. (Written in JS and uses React, bootstrap, Webpack ect.)",
        "imageNames" :["titleScreenShot.png", "metaScreenShot.png", "coding.svg"],
        "private": false,
        "form": "https://github.com/DillonHussey/DillonHussey.github.io/tree/master"
    },

    {
        "title": "Matrix Multiplication: Looptiling",
        "description": "This program was an assignment designed to show the impact of writing code using cache optimiziation. It uses a technique called looptiling, which breaks a data set into manageable parts called tiles, and completes computations on that tile and then moves on to the next one. The effect of looptiling is to drastically reduce the number of times data is read from memory, which is an expensive process. I cannot share pictures of the code, but shown right are the concepts. (Written in C and C++)",
        "imageNames" :["matrixMult.png", "cacheDiagram.png"],
        "private": true,
        "form": ""
    },

    {
        "title": "Mobile Development Class",
        "description": "This is a collection of projects I have completed for my Mobile Development class. This class encouraged self-learning to prepare us for when we are in the workforce, so we taught ourselves from the android developer's guide, making their example projects to demonstrate what we know. (Written in Kotlin)",
        "form": "",
        "private": true,
        "imageNames" :["DogglersSC.png", "WordSearchSC.png", "ConverterSC.png"]
    },

    {
        "title": "Testing and Code Coverage Exercise",
        "description": "I was supplied with a simple base project, and was instructed to complete a testing suite with Jest that achieves 100% code coverage. This project also introduced me to Github actions and I would love to learn more about them. (Written in JS)",
        "form": "",
        "private": true,
        "imageNames" :["codeCoverage.png", "testing1.png", "codeCoverageIstanbul.png"]
    },

    {
        "title": "Brewhaha",
        "description": "Brewhaha is a program that takes an image, and converts each pixel of some picture and turns into a cube which is offset on a third dimension by its brightness. This results in a simple 3d representation of the 2d image, which works really well for some images and not so great on some others. (Written in JS)",
        "form": "https://github.com/DillonHussey/Programming-Languages/tree/master/Javascript/brewhaha-DillonHussey",
        "private": false,
        "imageNames" :["tunnelBrewhaha.png", "shoesBrewhaha.png"]
    },

    {
        "title": "Pinball",
        "description": "This is a fun old project I did while learning Python. It uses a physics engine called Pymunk to emulate a classic pinball game. Please excuse the baby Yoda background, I thought it was funny at the time :) . (Written in Python)",
        "form": "https://github.com/DillonHussey/Programming-Languages/tree/master/Marble",
        "private": false,
        "imageNames" :["PinballYoda.png", "PinballCode.png"]
    }
]